BASICS

In [10]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4,5,6]], columns=["A", "B", "C"], index=["x", "y"])

In [9]:
df.head(1)
df.tail(1)
df.columns
df.index.tolist()
df.info()
df.describe()
df.nunique() # unique values in each column
df["A"].unique() # unique values in column "A"
df.shape # table dimensions

['x', 'y']

LOADING IN DATAFRAMES

In [55]:
import pandas as pd

coffee = pd.read_csv('./warmup-data/coffee.csv')
# results = pd.read_parquet('./data/results.parquet')
# olympics_data = pd.read_excel('./data/olympics-data.xlsx')
# parqued_df = df.to_parquet()

Accessing Data

In [52]:
coffee.loc[1:4] # [rows], [cols] | upper index inclusive
coffee.loc[[1, 4, 6], ["Day", "Units Sold"]]
coffee.iloc[[1, 4, 6], [1, 2]] # purely indices | upper index exclusive
coffee = coffee.set_index("Day")
coffee.loc["Monday" : "Wednesday"]
coffee.reset_index(inplace=True) # inplace resets the index column to be a normal column (drop=True would drop the column altogether)
coffee.at[0, "Units Sold"] # get a single value quickly
coffee.iat[0, 0] # purely indices

# coffee.Day # Works if is a single word, I don't like it
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0, 1]) # Sorts by order of parameter | 0 = desc, 1 = asc

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

Filtering Data

In [17]:
bios = pd.read_csv('./data/bios.csv')
bios.loc[(bios["height_cm"] > 215) & (bios["born_country"] == "USA"), ["name", "height_cm"]]
bios[bios["name"].str.contains("keith", case=False, regex=False)] # can use regex
bios[bios["born_country"].isin(["USA", "FRA", "GBR"])] # Checks if args in isin are in specified column
bios.query('born_country == "USA"') # Different way to query

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

Adding / Removing Columns

In [59]:
import numpy as np

coffee['price'] = 4.99
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99) # First price corresponds to first arg, second price is default
coffee.drop(0) # Drop 0th index (row)
coffee.drop(columns=['price'], inplace=True) # inplace makes the change permanent | can also make this the value of a variable to remove the need of inplace
coffee_new = coffee.copy() # copy() does a deep copy, otherwise is a shallow copy
coffee_new = coffee[["Day", "Coffee Type"]] # Drops all other columns
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']
coffee.head(10)

         Day Coffee Type  Units Sold  new_price  revenue
0     Monday    Espresso          25       3.99    99.75
1     Monday       Latte          15       5.99    89.85
2    Tuesday    Espresso          30       3.99   119.70
3    Tuesday       Latte          20       5.99   119.80
4  Wednesday    Espresso          35       3.99   139.65
5  Wednesday       Latte          25       5.99   149.75
6   Thursday    Espresso          40       3.99   159.60
7   Thursday       Latte          30       5.99   179.70
8     Friday    Espresso          45       3.99   179.55
9     Friday       Latte          35       5.99   209.65

In [63]:
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date']) # can specify format="%Y-%m-%d" etc.
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name', 'born_year']]
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    else:
        return 'Non-lightweight'

bios['Category'] = bios.apply(categorize_athlete, axis = 1) # axis = 1 for rows, axis = 0 for columns

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall

Merging & Concatenating Data

In [68]:
nocs = pd.read_csv('./data/noc_regions.csv')
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='inner') # normal data table joining | suffixes=[arg1, arg2] adds suffixes to specified columns that are duplicates between tables
bios_new.rename(columns={'region' : 'born_country_full'}, inplace=True)
bios_new[bios_new['NOC_x'] != bios_new['born_country_full']] # x, y are default suffixes for common columns
usa = bios[bios['born_country'] == 'USA'].copy()
gbr = bios[bios['born_country'] == 'GBR'].copy()
new_df = pd.concat([usa, gbr]) # combine two dfs into one
combined_df = pd.merge(results, bios, on='athlete_id', how='left')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,Average
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,Average
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,Short
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,Tall
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,Average
1346,1353,Gillian Boxx,1973-09-01,Fontana,California,USA,United States,170.0,NaN,NaN,Average
1356,1363,Sheila Cornell-Douty,1962-02-26,Encino,California,USA,United States,175.0,81.0,NaN,Average
1365,1372,Lisa Fernandez,1971-02-22,Long Beach,California,USA,United States,167.0,77.0,NaN,Average
1371,1378,Michele Granger,1970-01-15,Placentia,California,USA,United States,180.0,NaN,NaN,Average
1375,1382,Lori Harrigan,1970-09-05,Anaheim,California,USA,United States,182.0,99.0,NaN,Average

Handling Null Values

In [69]:
import numpy as np

coffee_null = coffee.copy()
coffee_null.loc[[0, 1], 'Units Sold'] = np.nan
coffee_null.fillna(coffee['Units Sold'].mean()) # Purely average (like Stranger Things)
coffee_null.fillna(coffee['Units Sold'].interpolate()) # Follows existing pattern
coffee_null.dropna(subset=['Units Sold'], inplace=True) # Drops any rows with NaN in the subset column
coffee[coffee['Units Sold'].notna()] # Gets every row without a NaN in the specified column

         Day Coffee Type  Units Sold  new_price  revenue
0     Monday    Espresso          25       3.99    99.75
1     Monday       Latte          15       5.99    89.85
2    Tuesday    Espresso          30       3.99   119.70
3    Tuesday       Latte          20       5.99   119.80
4  Wednesday    Espresso          35       3.99   139.65

Aggregating Data

In [ ]:
bios['born_city'].value_counts() # Gets count of everything in that column
bios[bios['born_country'] == 'USA']['born_region'].value_counts() # Grabs everything in born region such that the born country is USA

coffee.groupby(['Coffee Type'])['Units Sold'].sum() # Sums everything in that column based on the groupby parameter
coffee.groupby(['Coffee Type']).agg({'Units Sold' : 'sum', 'new_price' : 'mean', 'Coffee Type' : 'count'}) # Agg allows you to use multiple agg functions in one query
# Also has aggfunc

pivot = coffee.pivot(columns='Coffee Type', index='Day', values='revenue') # Can't escape Excel's pivot tables I guess
# As a reminder, takes the values in the specified columns and makes them a columns in the new pivot table with the specified values as its data and the specified index as its...index
# Also has pivot_table() which has aggfunc to simplify the .agg usage

Advanced Functionality

In [ ]:
coffee['yesterday_revenue'] = coffee['revenue'].shift(2) # Shifts the revenue rows back by 2 to compare, can shift by negative values too
coffee['pct_change'] = coffee['revenue'] / coffee['yesterday_revenue'] * 100

bios['height_rank'] = bios['height_cm'].rank() # Ranks values in column using a max function (different from sorting) | Will assign the mean of ranks between items with same value (ex 2, 3 become 2.5)
bios.sort_values(['height_rank'], ascending=False)

df = pd.DataFrame(
    data={'Animal': ['cat', 'penguin', 'dog', 'spider', 'snake'], 'Number_legs': [4, 2, 4, 8, np.nan]}
)
df['default_rank'] = df['Number_legs'].rank()
df['max_rank'] = df['Number_legs'].rank(method='max') # can change to min
df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom') # default for NaN
df['pct_rank'] = df['Number_legs'].rank(pct=True) # literally the ranks but as percentages (x / largest rank)
###
#     Animal      Number_legs  default_rank  max_rank  NA_bottom  pct_rank
# 0      cat          4.0           2.5       3.0        2.5     0.625
# 1  penguin          2.0           1.0       1.0        1.0     0.250
# 2      dog          4.0           2.5       3.0        2.5     0.625
# 3   spider          8.0           4.0       4.0        4.0     1.000
# 4    snake          NaN           NaN       NaN        5.0       NaN
###

# .select_dtypes('float') # only specific data types used
coffee['cumulative_revenue'] = coffee['revenue'].cumsum()
latte = coffee[coffee['Coffee Type'] == 'Latte'].copy()
latte['Units Sold'].rolling(3).sum() # Sums over the last 3 days for each entry

New Functionality (1.x -> 2.x)

In [ ]:
results_arrow = pd.read_csv('./data/results.csv', engine='pyarrow', dtype_backend='pyarrow') # pyarrow optimizes numpy backend, especially for strings